posts/notes/java-problems/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Java Problems | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/notes/java-problems/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../java-troubleshooting/" title="Java Troubleshotting Note" type="text/html">
<link rel="next" href="../java-interview-questions/" title="Java Interview Questions" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Java Problems">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/notes/java-problems/">
<meta property="og:description" content="Table of Contents


Unable to connect through SSL/HTTPS

The problem
Cause
Resolution
Specific on the Letsencrypt certificates







Unable to connect through SSL/HTTPS


The problem


When trying to">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T00:00:00+01:00">
<meta property="article:tag" content="java">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Java Problems</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-14T00:00:00+01:00" itemprop="datePublished" title="2017-07-14 00:00">2017-07-14 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="#sec-1">Unable to connect through SSL/HTTPS</a>
<ul>
<li><a href="#sec-1-1">The problem</a></li>
<li><a href="#sec-1-2">Cause</a></li>
<li><a href="#sec-1-3">Resolution</a></li>
<li><a href="#sec-1-4">Specific on the Letsencrypt certificates</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Unable to connect through SSL/HTTPS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">The problem</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When trying to connect through a HTTPS connection, the java
HTTPConnection through the following exception:
</p>
<p class="verse">
Caused by: javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed: sun.security.provider.certpath.SunCertPathBuilderException: unable to find valid certification path to requested target<br>
        at sun.security.ssl.Alerts.getSSLException(Alerts.java:192) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.SSLSocketImpl.fatal(SSLSocketImpl.java:1949) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.Handshaker.fatalSE(Handshaker.java:302) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.Handshaker.fatalSE(Handshaker.java:296) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.ClientHandshaker.serverCertificate(ClientHandshaker.java:1509) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.ClientHandshaker.processMessage(ClientHandshaker.java:216) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.Handshaker.processLoop(Handshaker.java:979) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.Handshaker.process<sub>record</sub>(Handshaker.java:914) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.SSLSocketImpl.readRecord(SSLSocketImpl.java:1062) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.SSLSocketImpl.performInitialHandshake(SSLSocketImpl.java:1375) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.SSLSocketImpl.startHandshake(SSLSocketImpl.java:1403) ~[na:1.8.0<sub>65]</sub><br>
        at sun.security.ssl.SSLSocketImpl.startHandshake(SSLSocketImpl.java:1387) ~[na:1.8.0<sub>65]</sub><br>
        at sun.net.www.protocol.https.HttpsClient.afterConnect(HttpsClient.java:559) ~[na:1.8.0<sub>65]</sub><br>
        at sun.net.www.protocol.https.AbstractDelegateHttpsURLConnection.connect(AbstractDelegateHttpsURLConnection.java:185) ~[na:1.8.0<sub>65]</sub><br>
        at sun.net.www.protocol.http.HttpURLConnection.getInputStream0(HttpURLConnection.java:1513) ~[na:1.8.0<sub>65]</sub><br>
        at sun.net.www.protocol.http.HttpURLConnection.getInputStream(HttpURLConnection.java:1441) ~[na:1.8.0<sub>65]</sub><br>
        at java.net.HttpURLConnection.getResponseCode(HttpURLConnection.java:480) ~[na:1.8.0<sub>65]</sub><br></p>
<p>
The HTTPS certficate is issued with letsencrypt.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Cause</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Whenever Java attempts to connect to another application over SSL (e.g.: HTTPS,
IMAPS, LDAPS), it will only be able to connect to that application if
it can trust it.
</p>

<p>
The way trust is handled in the Java world is that you have a keystore
(typically <b>$JAVA<sub>HOME</sub>/lib/security/cacerts</b>), also known as the
<b>truststore</b>. This contains a list of <b>all</b> known Certificate
Authority (CA) certificates, and Java will only trust certificates
that are signed by one of those CAs or public certificates that exist
within that keystore.
</p>

<p>
For example, if we look at the certificate for Atlassian, we can see
that the <b>*.atlassian.com</b> certificate has been signed by the
intermediate certificates, <b>DigiCert High Assurance EV Root CA</b> and
<b>DigiCert High Assurance CA-3</b>. These intermediate certificates have
been signed by the root <b>Entrust.net Secure Server CA</b>.
</p>

<p>
Theese three certificates combined are referred to as the certificate
chain. As they are all within the Java keystore, Java will trust any
certificates signed by them.
</p>

<p>
Alternatively, if the <b>.atlassian.com</b> certificate had been in the
keystore, Java would also trust that site.
</p>

<p>
This problem is therefore caused by a certificate that is <i>self-signed</i>
(a CA did not sign it) or <b>a certificate chain that does not exist
within the Java truststore</b>. Java does not trust the certificate and
fails to connect to the application.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Resolution</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Make sure you have imported the public certificate of the target
instance into the truststore.
</li>
<li>Make sure any certificates have been imported into the correct
truststore; you may have multiple JRE/JDKs.
</li>
<li>Check to see that the correct truststore is in use. If
<b>-Djavax.net.ssl.trustStore</b> has been configured, it will override
the location of the default truststore, which will need to be
checked.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Specific on the Letsencrypt certificates</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Up until Java 8u101, Java don't trust Let's Encrypt certificates out
of the box. The truststore of Oracle JDK/JRE contains neither the
Let's Encrypt CA specifically, or the IdenTrust CA that cross signed it.
</p>

<p>
For a local configuration changes:
</p>
<div class="highlight"><pre><span></span>keytool -trustcacerts <span class="se">\</span>
    -keystore <span class="nv">$JAVA_HOME</span>/jre/lib/security/cacerts <span class="se">\</span>
    -storepass changeit <span class="se">\</span>
    -noprompt <span class="se">\</span>
    -importcert <span class="se">\</span>
    -file /etc/letsencrypt/live/hostname.com/chain.pem
</pre></div>

<p>
To update the java version to the latest on RaspberryPi, following:
<a href="https://www.linuxbabe.com/desktop-linux/install-oracle-java-8-debian-jessie-raspbian-jessie-via-ppa">https://www.linuxbabe.com/desktop-linux/install-oracle-java-8-debian-jessie-raspbian-jessie-via-ppa</a>
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/java/" rel="tag">java</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../java-troubleshooting/" rel="prev" title="Java Troubleshotting Note">Previous post</a>
            </li>
            <li class="next">
                <a href="../java-interview-questions/" rel="next" title="Java Interview Questions">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
